In [2]:
import pandas as pd

pd.__version__

'2.3.3'

In [4]:
df = pd.read_csv("../data/president_heights.csv")
df.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [8]:
df.tail(10)

    order               name  height(cm)
32     35    John F. Kennedy         183
33     36  Lyndon B. Johnson         193
34     37      Richard Nixon         182
35     38        Gerald Ford         183
36     39       Jimmy Carter         177
37     40      Ronald Reagan         185
38     41  George H. W. Bush         188
39     42       Bill Clinton         188
40     43     George W. Bush         182
41     44       Barack Obama         185

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       42 non-null     int64
 1   name        42 non-null     object
 2   height(cm)  42 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.1+ KB

In [10]:
df.describe()

           order  height(cm)
count  42.000000   42.000000
mean   22.476190  179.738095
std    13.152461    7.015869
min     1.000000  163.000000
25%    11.250000  174.250000
50%    22.000000  182.000000
75%    33.750000  183.000000
max    44.000000  193.000000

In [21]:
df.index

RangeIndex(start=0, stop=42, step=1)

In [24]:
df.columns

Index(['order', 'name', 'height(cm)'], dtype='object')

In [26]:
df.columns = ['order', 'name', 'height']
df.columns

Index(['order', 'name', 'height'], dtype='object')

In [30]:
df.values

array([[1, 'George Washington', 189],
       [2, 'John Adams', 170],
       [3, 'Thomas Jefferson', 189],
       [4, 'James Madison', 163],
       [5, 'James Monroe', 183],
       [6, 'John Quincy Adams', 171],
       [7, 'Andrew Jackson', 185],
       [8, 'Martin Van Buren', 168],
       [9, 'William Henry Harrison', 173],
       [10, 'John Tyler', 183],
       [11, 'James K. Polk', 173],
       [12, 'Zachary Taylor', 173],
       [13, 'Millard Fillmore', 175],
       [14, 'Franklin Pierce', 178],
       [15, 'James Buchanan', 183],
       [16, 'Abraham Lincoln', 193],
       [17, 'Andrew Johnson', 178],
       [18, 'Ulysses S. Grant', 173],
       [19, 'Rutherford B. Hayes', 174],
       [20, 'James A. Garfield', 183],
       [21, 'Chester A. Arthur', 183],
       [23, 'Benjamin Harrison', 168],
       [25, 'William McKinley', 170],
       [26, 'Theodore Roosevelt', 178],
       [27, 'William Howard Taft', 182],
       [28, 'Woodrow Wilson', 180],
       [29, 'Warren G. Harding', 183],
       [30, 'Calvin Coolidge', 178],
       [31, 'Herbert Hoover', 182],
       [32, 'Franklin D. Roosevelt', 188],
       [33, 'Harry S. Truman', 175],
       [34, 'Dwight D. Eisenhower', 179],
       [35, 'John F. Kennedy', 183],
       [36, 'Lyndon B. Johnson', 193],
       [37, 'Richard Nixon', 182],
       [38, 'Gerald Ford', 183],
       [39, 'Jimmy Carter', 177],
       [40, 'Ronald Reagan', 185],
       [41, 'George H. W. Bush', 188],
       [42, 'Bill Clinton', 188],
       [43, 'George W. Bush', 182],
       [44, 'Barack Obama', 185]], dtype=object)

In [31]:
df.shape

(42, 3)

'''SQL
SELECT 'order', 'name'
FROM df; --president_heights
WHERE height > 180 and order >= 20
ORDEY BY height DESC
'''

In [39]:
cols = ['order','name']
df[cols]

    order                    name
0       1       George Washington
1       2              John Adams
2       3        Thomas Jefferson
3       4           James Madison
4       5            James Monroe
5       6       John Quincy Adams
6       7          Andrew Jackson
7       8        Martin Van Buren
8       9  William Henry Harrison
9      10              John Tyler
10     11           James K. Polk
11     12          Zachary Taylor
12     13        Millard Fillmore
13     14         Franklin Pierce
14     15          James Buchanan
15     16         Abraham Lincoln
16     17          Andrew Johnson
17     18        Ulysses S. Grant
18     19     Rutherford B. Hayes
19     20       James A. Garfield
20     21       Chester A. Arthur
21     23       Benjamin Harrison
22     25        William McKinley
23     26      Theodore Roosevelt
24     27     William Howard Taft
25     28          Woodrow Wilson
26     29       Warren G. Harding
27     30         Calvin Coolidge
28     31          Herbert Hoover
29     32   Franklin D. Roosevelt
30     33         Harry S. Truman
31     34    Dwight D. Eisenhower
32     35         John F. Kennedy
33     36       Lyndon B. Johnson
34     37           Richard Nixon
35     38             Gerald Ford
36     39            Jimmy Carter
37     40           Ronald Reagan
38     41       George H. W. Bush
39     42            Bill Clinton
40     43          George W. Bush
41     44            Barack Obama

In [37]:
df.loc[:, cols]

    order                    name
0       1       George Washington
1       2              John Adams
2       3        Thomas Jefferson
3       4           James Madison
4       5            James Monroe
5       6       John Quincy Adams
6       7          Andrew Jackson
7       8        Martin Van Buren
8       9  William Henry Harrison
9      10              John Tyler
10     11           James K. Polk
11     12          Zachary Taylor
12     13        Millard Fillmore
13     14         Franklin Pierce
14     15          James Buchanan
15     16         Abraham Lincoln
16     17          Andrew Johnson
17     18        Ulysses S. Grant
18     19     Rutherford B. Hayes
19     20       James A. Garfield
20     21       Chester A. Arthur
21     23       Benjamin Harrison
22     25        William McKinley
23     26      Theodore Roosevelt
24     27     William Howard Taft
25     28          Woodrow Wilson
26     29       Warren G. Harding
27     30         Calvin Coolidge
28     31          Herbert Hoover
29     32   Franklin D. Roosevelt
30     33         Harry S. Truman
31     34    Dwight D. Eisenhower
32     35         John F. Kennedy
33     36       Lyndon B. Johnson
34     37           Richard Nixon
35     38             Gerald Ford
36     39            Jimmy Carter
37     40           Ronald Reagan
38     41       George H. W. Bush
39     42            Bill Clinton
40     43          George W. Bush
41     44            Barack Obama

In [45]:
df['height'] > 180
mask = df.height > 180
df[mask]

    order                   name  height
0       1      George Washington     189
2       3       Thomas Jefferson     189
4       5           James Monroe     183
6       7         Andrew Jackson     185
9      10             John Tyler     183
14     15         James Buchanan     183
15     16        Abraham Lincoln     193
19     20      James A. Garfield     183
20     21      Chester A. Arthur     183
24     27    William Howard Taft     182
26     29      Warren G. Harding     183
28     31         Herbert Hoover     182
29     32  Franklin D. Roosevelt     188
32     35        John F. Kennedy     183
33     36      Lyndon B. Johnson     193
34     37          Richard Nixon     182
35     38            Gerald Ford     183
37     40          Ronald Reagan     185
38     41      George H. W. Bush     188
39     42           Bill Clinton     188
40     43         George W. Bush     182
41     44           Barack Obama     185

In [46]:
mask = (df.height > 180) & (df.order >= 20)
df[mask]

    order                   name  height
19     20      James A. Garfield     183
20     21      Chester A. Arthur     183
24     27    William Howard Taft     182
26     29      Warren G. Harding     183
28     31         Herbert Hoover     182
29     32  Franklin D. Roosevelt     188
32     35        John F. Kennedy     183
33     36      Lyndon B. Johnson     193
34     37          Richard Nixon     182
35     38            Gerald Ford     183
37     40          Ronald Reagan     185
38     41      George H. W. Bush     188
39     42           Bill Clinton     188
40     43         George W. Bush     182
41     44           Barack Obama     185

In [50]:
df.sort_values(['height','order'], ascending=False)

    order                    name  height
33     36       Lyndon B. Johnson     193
15     16         Abraham Lincoln     193
2       3        Thomas Jefferson     189
0       1       George Washington     189
39     42            Bill Clinton     188
38     41       George H. W. Bush     188
29     32   Franklin D. Roosevelt     188
41     44            Barack Obama     185
37     40           Ronald Reagan     185
6       7          Andrew Jackson     185
35     38             Gerald Ford     183
32     35         John F. Kennedy     183
26     29       Warren G. Harding     183
20     21       Chester A. Arthur     183
19     20       James A. Garfield     183
14     15          James Buchanan     183
9      10              John Tyler     183
4       5            James Monroe     183
40     43          George W. Bush     182
34     37           Richard Nixon     182
28     31          Herbert Hoover     182
24     27     William Howard Taft     182
25     28          Woodrow Wilson     180
31     34    Dwight D. Eisenhower     179
27     30         Calvin Coolidge     178
23     26      Theodore Roosevelt     178
16     17          Andrew Johnson     178
13     14         Franklin Pierce     178
36     39            Jimmy Carter     177
30     33         Harry S. Truman     175
12     13        Millard Fillmore     175
18     19     Rutherford B. Hayes     174
17     18        Ulysses S. Grant     173
11     12          Zachary Taylor     173
10     11           James K. Polk     173
8       9  William Henry Harrison     173
5       6       John Quincy Adams     171
22     25        William McKinley     170
1       2              John Adams     170
21     23       Benjamin Harrison     168
7       8        Martin Van Buren     168
3       4           James Madison     163

SELECT 'order', 'name'
FROM df --president_heights
WHERE height > 180 and order >= 20
ORDEY BY height DESC
LIMIT 5;

In [52]:
mask = (df.height > 180) & (df.order >= 20)
cols = ['order', 'name']

df[mask].sort_values(['height'],ascending=False).loc[:,cols].head()

    order                   name
33     36      Lyndon B. Johnson
38     41      George H. W. Bush
29     32  Franklin D. Roosevelt
39     42           Bill Clinton
37     40          Ronald Reagan

In [64]:
df.iloc[1:3,:2]

   order              name
1      2        John Adams
2      3  Thomas Jefferson

In [66]:
df.sort_index().head()

   order               name  height
0      1  George Washington     189
1      2         John Adams     170
2      3   Thomas Jefferson     189
3      4      James Madison     163
4      5       James Monroe     183

In [ ]:
df['height'] / 10

0     18.9
1     17.0
2     18.9
3     16.3
4     18.3
5     17.1
6     18.5
7     16.8
8     17.3
9     18.3
10    17.3
11    17.3
12    17.5
13    17.8
14    18.3
15    19.3
16    17.8
17    17.3
18    17.4
19    18.3
20    18.3
21    16.8
22    17.0
23    17.8
24    18.2
25    18.0
26    18.3
27    17.8
28    18.2
29    18.8
30    17.5
31    17.9
32    18.3
33    19.3
34    18.2
35    18.3
36    17.7
37    18.5
38    18.8
39    18.8
40    18.2
41    18.5
Name: height, dtype: float64

In [71]:
import numpy as np

arr = np.array([1,2,3])
arr / 10

array([0.1, 0.2, 0.3])

In [136]:
abb = pd.read_csv("../data/state-abbrevs.csv")
area = pd.read_csv("../data/state-areas.csv")
pop = pd.read_csv("../data/state-population.csv")

In [76]:
abb.shape, area.shape, pop.shape

((51, 2), (52, 2), (2544, 4))

In [80]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [84]:
pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2544 entries, 0 to 2543
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   state/region  2544 non-null   object
 1   ages          2544 non-null   object
 2   year          2544 non-null   int64
 3   population    2524 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 79.6+ KB

In [116]:
pop.columns = ['abb', 'ages', 'year', 'population']

SELECT abb.'state', abb.'abb', area.'area'
FROM abb, area, pop
WHERE state = 'Arizona'
    AND abb.state = area.state
    AND abb.abb = pop.state
ORDER BY abb DESC

In [86]:
abb.columns = ['state', 'abb']

In [94]:
abb[abb.state == 'Arizona']

     state abb
2  Arizona  AZ

In [101]:
abb.sort_values('state', ascending=False).head()

            state abb
50        Wyoming  WY
49      Wisconsin  WI
48  West Virginia  WV
47     Washington  WA
46       Virginia  VA

In [105]:
join1 = pd.merge(area, abb, how = 'left', left_on='state', right_on='state')
join1

                   state  area (sq. mi)  abb
0                Alabama          52423   AL
1                 Alaska         656425   AK
2                Arizona         114006   AZ
3               Arkansas          53182   AR
4             California         163707   CA
5               Colorado         104100   CO
6            Connecticut           5544   CT
7               Delaware           1954   DE
8                Florida          65758   FL
9                Georgia          59441   GA
10                Hawaii          10932   HI
11                 Idaho          83574   ID
12              Illinois          57918   IL
13               Indiana          36420   IN
14                  Iowa          56276   IA
15                Kansas          82282   KS
16              Kentucky          40411   KY
17             Louisiana          51843   LA
18                 Maine          35387   ME
19              Maryland          12407   MD
20         Massachusetts          10555   MA
21              Michigan          96810   MI
22             Minnesota          86943   MN
23           Mississippi          48434   MS
24              Missouri          69709   MO
25               Montana         147046   MT
26              Nebraska          77358   NE
27                Nevada         110567   NV
28         New Hampshire           9351   NH
29            New Jersey           8722   NJ
30            New Mexico         121593   NM
31              New York          54475   NY
32        North Carolina          53821   NC
33          North Dakota          70704   ND
34                  Ohio          44828   OH
35              Oklahoma          69903   OK
36                Oregon          98386   OR
37          Pennsylvania          46058   PA
38          Rhode Island           1545   RI
39        South Carolina          32007   SC
40          South Dakota          77121   SD
41             Tennessee          42146   TN
42                 Texas         268601   TX
43                  Utah          84904   UT
44               Vermont           9615   VT
45              Virginia          42769   VA
46            Washington          71303   WA
47         West Virginia          24231   WV
48             Wisconsin          65503   WI
49               Wyoming          97818   WY
50  District of Columbia             68   DC
51           Puerto Rico           3515  NaN

In [ ]:
where = area['state'] == 'Puerto Rico'
area[where]

          state  area (sq. mi)
51  Puerto Rico           3515

In [117]:
join2 = pd.merge(pop, join1, how = 'left', left_on='abb', right_on='abb')
join2

      abb     ages  year   population    state  area (sq. mi)
0      AL  under18  2012    1117489.0  Alabama        52423.0
1      AL    total  2012    4817528.0  Alabama        52423.0
2      AL  under18  2010    1130966.0  Alabama        52423.0
3      AL    total  2010    4785570.0  Alabama        52423.0
4      AL  under18  2011    1125763.0  Alabama        52423.0
...   ...      ...   ...          ...      ...            ...
2539  USA    total  2010  309326295.0      NaN            NaN
2540  USA  under18  2011   73902222.0      NaN            NaN
2541  USA    total  2011  311582564.0      NaN            NaN
2542  USA  under18  2012   73708179.0      NaN            NaN
2543  USA    total  2012  313873685.0      NaN            NaN

[2544 rows x 6 columns]

In [124]:
print(abb.head())
print(area.head())

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [128]:
new_df = pd.merge(area, abb, how='left')
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   state          52 non-null     object
 1   area (sq. mi)  52 non-null     int64
 2   abbreviation   51 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.3+ KB

In [129]:
abb.set_index(['state'],drop=False)

                                     state abbreviation
state
Alabama                            Alabama           AL
Alaska                              Alaska           AK
Arizona                            Arizona           AZ
Arkansas                          Arkansas           AR
California                      California           CA
Colorado                          Colorado           CO
Connecticut                    Connecticut           CT
Delaware                          Delaware           DE
District of Columbia  District of Columbia           DC
Florida                            Florida           FL
Georgia                            Georgia           GA
Hawaii                              Hawaii           HI
Idaho                                Idaho           ID
Illinois                          Illinois           IL
Indiana                            Indiana           IN
Iowa                                  Iowa           IA
Kansas                              Kansas           KS
Kentucky                          Kentucky           KY
Louisiana                        Louisiana           LA
Maine                                Maine           ME
Montana                            Montana           MT
Nebraska                          Nebraska           NE
Nevada                              Nevada           NV
New Hampshire                New Hampshire           NH
New Jersey                      New Jersey           NJ
New Mexico                      New Mexico           NM
New York                          New York           NY
North Carolina              North Carolina           NC
North Dakota                  North Dakota           ND
Ohio                                  Ohio           OH
Oklahoma                          Oklahoma           OK
Oregon                              Oregon           OR
Maryland                          Maryland           MD
Massachusetts                Massachusetts           MA
Michigan                          Michigan           MI
Minnesota                        Minnesota           MN
Mississippi                    Mississippi           MS
Missouri                          Missouri           MO
Pennsylvania                  Pennsylvania           PA
Rhode Island                  Rhode Island           RI
South Carolina              South Carolina           SC
South Dakota                  South Dakota           SD
Tennessee                        Tennessee           TN
Texas                                Texas           TX
Utah                                  Utah           UT
Vermont                            Vermont           VT
Virginia                          Virginia           VA
Washington                      Washington           WA
West Virginia                West Virginia           WV
Wisconsin                        Wisconsin           WI
Wyoming                            Wyoming           WY

In [135]:
pd.merge(area, abb)

                   state  area (sq. mi) abbreviation
0                Alabama          52423           AL
1                 Alaska         656425           AK
2                Arizona         114006           AZ
3               Arkansas          53182           AR
4             California         163707           CA
5               Colorado         104100           CO
6            Connecticut           5544           CT
7               Delaware           1954           DE
8                Florida          65758           FL
9                Georgia          59441           GA
10                Hawaii          10932           HI
11                 Idaho          83574           ID
12              Illinois          57918           IL
13               Indiana          36420           IN
14                  Iowa          56276           IA
15                Kansas          82282           KS
16              Kentucky          40411           KY
17             Louisiana          51843           LA
18                 Maine          35387           ME
19              Maryland          12407           MD
20         Massachusetts          10555           MA
21              Michigan          96810           MI
22             Minnesota          86943           MN
23           Mississippi          48434           MS
24              Missouri          69709           MO
25               Montana         147046           MT
26              Nebraska          77358           NE
27                Nevada         110567           NV
28         New Hampshire           9351           NH
29            New Jersey           8722           NJ
30            New Mexico         121593           NM
31              New York          54475           NY
32        North Carolina          53821           NC
33          North Dakota          70704           ND
34                  Ohio          44828           OH
35              Oklahoma          69903           OK
36                Oregon          98386           OR
37          Pennsylvania          46058           PA
38          Rhode Island           1545           RI
39        South Carolina          32007           SC
40          South Dakota          77121           SD
41             Tennessee          42146           TN
42                 Texas         268601           TX
43                  Utah          84904           UT
44               Vermont           9615           VT
45              Virginia          42769           VA
46            Washington          71303           WA
47         West Virginia          24231           WV
48             Wisconsin          65503           WI
49               Wyoming          97818           WY
50  District of Columbia             68           DC

In [137]:
print(abb.head())
print(area.head())
print(pop.head())

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [147]:
merged=pd.merge(pop,abb, how='outer', left_on='state/region',right_on='abbreviation')
merged = merged.drop('abbreviation', axis = 1)
merged.head()

  state/region     ages  year  population   state
0           AK    total  1990    553290.0  Alaska
1           AK  under18  1990    177502.0  Alaska
2           AK    total  1992    588736.0  Alaska
3           AK  under18  1991    182180.0  Alaska
4           AK  under18  1992    184878.0  Alaska

In [148]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [149]:
mask = merged['population'].isnull()
merged[mask].head()

     state/region     ages  year  population state
1872           PR  under18  1990         NaN   NaN
1873           PR    total  1990         NaN   NaN
1874           PR    total  1991         NaN   NaN
1875           PR  under18  1991         NaN   NaN
1876           PR    total  1993         NaN   NaN